[
  {
    "Title": "The Colour of Magic",
    "Description": "The first novel in Terry Pratchett’s Discworld series introduces readers to the flat world balanced on the backs of four elephants which themselves stand on the shell of a giant turtle. The story follows Rincewind, a cowardly and inept wizard, as he is forced to guide the Discworld's first tourist, Twoflower. Together, they embark on a chaotic and darkly humorous journey that parodies traditional fantasy tropes. Pratchett combines satire, imagination, and biting wit to craft a world both bizarre and familiar, setting the tone for the rest of the beloved Discworld series. This book is a brilliant entry point into a unique fantasy universe.",
    "PictureURL": "/images/colour_of_magic.jpg",
    "ReleaseYear": 1983,
    "Rating": 0,
    "PageNumber": 210,
    "Price": 15.99,
    "ISBN": "9780552134430",
    "QuantityInStock": 12,
    "PublisherId": 2,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 1 ]
  },
  {
    "Title": "A Game of Thrones",
    "Description": "In the frozen lands of the North and the sun-scorched South of Westeros, noble houses struggle for control of the Iron Throne. George R. R. Martin’s opening volume of the epic fantasy saga 'A Song of Ice and Fire' weaves together the stories of honor, betrayal, power, and ambition. With complex characters like Eddard Stark, Tyrion Lannister, and Daenerys Targaryen, the novel sets the tone for a rich and morally ambiguous world. Magic is returning, ancient creatures awaken, and winter is coming. Deep political intrigue and emotionally charged storytelling make this one of the most acclaimed modern fantasy books.",
    "PictureURL": "/images/game_of_thrones.jpg",
    "ReleaseYear": 1996,
    "Rating": 0,
    "PageNumber": 694,
    "Price": 20.00,
    "ISBN": "9780553103540",
    "QuantityInStock": 8,
    "PublisherId": 3,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 2 ]
  },
  {
    "Title": "Harry Potter and the Sorcerer's Stone",
    "Description": "Harry Potter, an orphan raised by cruel relatives, discovers on his eleventh birthday that he is a wizard. Whisked away to Hogwarts School of Witchcraft and Wizardry, he makes friends, learns magic, and uncovers the truth about his parents' mysterious deaths. As Harry explores a world of enchantments, magical creatures, and hidden dangers, he also confronts the dark legacy left by the evil wizard Voldemort. The first book in J.K. Rowling’s worldwide phenomenon combines mystery, fantasy, and coming-of-age adventure, laying the foundation for a richly imagined series that captures the hearts of readers of all ages.",
    "PictureURL": "/images/harry_potter_1.jpg",
    "ReleaseYear": 1997,
    "Rating": 0,
    "PageNumber": 309,
    "Price": 18.50,
    "ISBN": "9780590353427",
    "QuantityInStock": 15,
    "PublisherId": 4,
    "GenreIds": [ 8, 9 ],
    "AuthorIds": [ 3 ]
  },
  {
    "Title": "The Hobbit",
    "Description": "Bilbo Baggins, a quiet and unassuming hobbit, is swept into an unexpected adventure when the wizard Gandalf and a group of dwarves recruit him to help reclaim a stolen treasure from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, goblins, elves, and a mysterious creature named Gollum. J.R.R. Tolkien’s classic fantasy novel serves as a prelude to The Lord of the Rings and introduces readers to Middle-earth. With themes of bravery, friendship, and self-discovery, 'The Hobbit' has captivated generations of readers and remains one of the most influential works in fantasy literature.",
    "PictureURL": "/images/the_hobbit.jpg",
    "ReleaseYear": 1937,
    "Rating": 0,
    "PageNumber": 310,
    "Price": 22.00,
    "ISBN": "9780547928227",
    "QuantityInStock": 10,
    "PublisherId": 5,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 4 ]
  },
  {
    "Title": "1984",
    "Description": "In a world dominated by totalitarian control and surveillance, Winston Smith, a worker in the Ministry of Truth, secretly rebels against the oppressive regime of Big Brother. As he begins to question the Party’s manipulations and falls in love, Winston’s actions lead him down a dangerous path of resistance. George Orwell’s dystopian masterpiece explores themes of censorship, propaganda, individuality, and truth. A chilling warning against authoritarianism, '1984' remains hauntingly relevant decades after its publication, highlighting how language and control can reshape reality. It is one of the most influential political novels ever written.",
    "PictureURL": "/images/1984.jpg",
    "ReleaseYear": 1949,
    "Rating": 0,
    "PageNumber": 328,
    "Price": 17.00,
    "ISBN": "9780451524935",
    "QuantityInStock": 20,
    "PublisherId": 6,
    "GenreIds": [ 22, 23 ],
    "AuthorIds": [ 5 ]
  },
  {
    "Title": "The Name of the Wind",
    "Description": "Kvothe, a gifted young man with a mysterious past, tells the story of his rise from a traveling troupe’s child to the most notorious wizard the world has ever seen. Living in hiding under a false identity, he recounts his life full of tragedy, music, love, and magic. 'The Name of the Wind' is a lyrical and immersive fantasy novel that blends myth, mystery, and legend into a powerful narrative. Patrick Rothfuss delivers a deeply emotional journey, with a compelling protagonist and richly detailed world. It’s a must-read for fans of character-driven epic fantasy.",
    "PictureURL": "/images/name_of_the_wind.jpg",
    "ReleaseYear": 2007,
    "Rating": 0,
    "PageNumber": 662,
    "Price": 21.00,
    "ISBN": "9780756404741",
    "QuantityInStock": 7,
    "PublisherId": 7,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 6 ]
  },
  {
    "Title": "Mistborn: The Final Empire",
    "Description": "In a world where ash falls from the sky and mist dominates the night, the Final Empire is ruled by an immortal tyrant known as the Lord Ruler. A band of rebels, led by the brilliant strategist Kelsier, recruits a young street thief named Vin who possesses extraordinary powers. Together, they plan a daring revolution. Brandon Sanderson crafts a unique magic system based on metals and a rich setting full of oppression, mystery, and hope. 'Mistborn' is a gripping tale of rebellion, sacrifice, and destiny that reinvents what epic fantasy can achieve.",
    "PictureURL": "/images/mistborn.jpg",
    "ReleaseYear": 2006,
    "Rating": 0,
    "PageNumber": 541,
    "Price": 19.50,
    "ISBN": "9780765311788",
    "QuantityInStock": 9,
    "PublisherId": 8,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 7 ]
  },
  {
    "Title": "The Wise Man's Fear",
    "Description": "In this gripping sequel to 'The Name of the Wind,' Kvothe continues his story of hardship, discovery, and magic. As he leaves the university, he travels to distant lands, learns deadly arts, encounters mythical beings, and deepens his pursuit of knowledge and vengeance. Patrick Rothfuss expands his world with new cultures, philosophies, and powerful secrets. Kvothe’s legend grows, but so do the mysteries surrounding him. 'The Wise Man’s Fear' is a beautifully written continuation of a modern classic, filled with lyrical prose, emotional depth, and unforgettable storytelling.",
    "PictureURL": "/images/wise_mans_fear.jpg",
    "ReleaseYear": 2011,
    "Rating": 0,
    "PageNumber": 994,
    "Price": 23.00,
    "ISBN": "9780756407926",
    "QuantityInStock": 5,
    "PublisherId": 7,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 6 ]
  },
  {
    "Title": "A Clash of Kings",
    "Description": "As Westeros is torn apart by war, five kings vie for control of the Iron Throne. Each claimant believes their cause is just, but treachery, ambition, and fate weave a deadly game. George R. R. Martin deepens the complexity of his world, expanding on the political intrigue, magical elements, and character struggles introduced in 'A Game of Thrones.' New alliances are forged, and ancient forces stir as darkness spreads. 'A Clash of Kings' is a masterful continuation that challenges every character and reshapes the destiny of the Seven Kingdoms.",
    "PictureURL": "/images/clash_of_kings.jpg",
    "ReleaseYear": 1998,
    "Rating": 0,
    "PageNumber": 768,
    "Price": 21.00,
    "ISBN": "9780553108033",
    "QuantityInStock": 6,
    "PublisherId": 3,
    "GenreIds": [ 8, 25 ],
    "AuthorIds": [ 2 ]
  },
  {
    "Title": "Harry Potter and the Chamber of Secrets",
    "Description": "In Harry's second year at Hogwarts, strange things begin happening: students are found petrified, and a mysterious message warns that the Chamber of Secrets has been opened. As danger grows, Harry and his friends delve into the school’s dark past to uncover the culprit behind the attacks. With new characters, magical creatures, and a deeper look into the history of Hogwarts, this installment adds depth and darkness to the beloved series. J.K. Rowling balances humor and suspense as Harry learns more about himself and the magical world he inhabits.",
    "PictureURL": "/images/harry_potter_2.jpg",
    "ReleaseYear": 1998,
    "Rating": 0,
    "PageNumber": 341,
    "Price": 18.50,
    "ISBN": "9780439064873",
    "QuantityInStock": 14,
    "PublisherId": 4,
    "GenreIds": [ 8, 9 ],
    "AuthorIds": [ 3 ]
  },
  {
    "Title": "Good Omens",
    "Description": "Written by Terry Pratchett and Neil Gaiman, 'Good Omens' is a comedic tale about the unlikely partnership between an angel and a demon as they attempt to prevent the apocalypse. Filled with witty dialogue, satirical takes on religion and humanity, and quirky characters, the novel blends fantasy and humor. The story explores themes of fate, free will, and the absurdity of the end times, making it a beloved cult classic that delights fans of both authors and newcomers to the genre alike.",
    "PictureURL": "/images/good_omens.jpg",
    "ReleaseYear": 1990,
    "Rating": 0,
    "PageNumber": 288,
    "Price": 16.00,
    "ISBN": "9780060853983",
    "QuantityInStock": 10,
    "PublisherId": 2,
    "GenreIds": [ 5, 8 ],
    "AuthorIds": [ 1 ]
  },
  {
    "Title": "The Silmarillion",
    "Description": "J.R.R. Tolkien’s 'The Silmarillion' is a collection of mythopoeic stories that provide the rich backstory to Middle-earth. It chronicles the creation of the world, the rise and fall of the Elves, the battles against the dark lord Morgoth, and the origins of many characters featured in 'The Hobbit' and 'The Lord of the Rings.' The dense and poetic narrative explores themes of power, fate, sacrifice, and the eternal struggle between good and evil, offering deep insight into Tolkien’s expansive universe.",
    "PictureURL": "/images/silmarillion.jpg",
    "ReleaseYear": 1977,
    "Rating": 0,
    "PageNumber": 365,
    "Price": 20.00,
    "ISBN": "9780618391110",
    "QuantityInStock": 8,
    "PublisherId": 5,
    "GenreIds": [ 25, 26 ],
    "AuthorIds": [ 4 ]
  },
  {
    "Title": "The Catcher in the Rye",
    "Description": "J.D. Salinger’s classic novel follows Holden Caulfield, a disaffected teenager navigating the challenges of adolescence in 1950s New York City. Through his cynical and often humorous narration, Holden reveals his struggles with identity, alienation, and loss of innocence. The novel’s themes of rebellion and search for meaning have resonated with generations of readers, making it a landmark work in American literature that explores the complexities of youth and mental health.",
    "PictureURL": "/images/catcher_in_the_rye.jpg",
    "ReleaseYear": 1951,
    "Rating": 0,
    "PageNumber": 277,
    "Price": 14.00,
    "ISBN": "9780316769488",
    "QuantityInStock": 13,
    "PublisherId": 9,
    "GenreIds": [ 15 ],
    "AuthorIds": [ 8 ]
  },
  {
    "Title": "The Martian",
    "Description": "Andy Weir’s 'The Martian' is a gripping science fiction novel about astronaut Mark Watney, who becomes stranded alone on Mars after a mission goes wrong. Using his ingenuity, engineering skills, and humor, Mark struggles to survive in the hostile environment while working to communicate with Earth. The book combines hard science with suspense and humanity, offering a realistic and inspiring tale of survival, resilience, and hope that has been praised for its scientific accuracy and thrilling narrative.",
    "PictureURL": "/images/the_martian.jpg",
    "ReleaseYear": 2011,
    "Rating": 0,
    "PageNumber": 369,
    "Price": 18.00,
    "ISBN": "9780553418026",
    "QuantityInStock": 12,
    "PublisherId": 10,
    "GenreIds": [ 11, 22 ],
    "AuthorIds": [ 9 ]
  },
  {
    "Title": "The Name of the Rose",
    "Description": "Umberto Eco’s 'The Name of the Rose' is a historical mystery set in a 14th-century Italian monastery. Brother William of Baskerville investigates a series of suspicious deaths while navigating religious politics and intellectual debates of the Middle Ages. The novel blends detective fiction with philosophy, theology, and medieval history, exploring themes of knowledge, heresy, and the power of interpretation. Its intricate plot and richly textured atmosphere have made it a celebrated classic worldwide.",
    "PictureURL": "/images/name_of_the_rose.jpg",
    "ReleaseYear": 1980,
    "Rating": 0,
    "PageNumber": 536,
    "Price": 19.00,
    "ISBN": "9780156001311",
    "QuantityInStock": 9,
    "PublisherId": 11,
    "GenreIds": [ 1, 13 ],
    "AuthorIds": [ 10 ]
  },
  {
    "Title": "Meditations",
    "Description": "A series of personal writings by Roman Emperor Marcus Aurelius, 'Meditations' offers insights into Stoic philosophy and practical wisdom for living a virtuous life. Written as a private journal, the work reflects on themes such as self-discipline, rationality, mortality, and acceptance of fate. Its timeless lessons on resilience and ethical conduct have inspired readers for centuries, making it a foundational text in both philosophy and self-development literature.",
    "PictureURL": "/images/meditations.jpg",
    "ReleaseYear": 180,
    "Rating": 0,
    "PageNumber": 254,
    "Price": 12.00,
    "ISBN": "9780486298238",
    "QuantityInStock": 20,
    "PublisherId": 12,
    "GenreIds": [ 7, 17 ],
    "AuthorIds": [ 11 ]
  },
  {
    "Title": "The Girl with the Dragon Tattoo",
    "Description": "Stieg Larsson’s thriller follows journalist Mikael Blomkvist and hacker Lisbeth Salander as they investigate a decades-old disappearance in a wealthy Swedish family. The novel combines elements of mystery, crime, and social critique, exposing corruption, violence, and secrets beneath a polished surface. Its gripping plot, complex characters, and dark themes have made it an international bestseller and launched a bestselling series known as the Millennium Trilogy.",
    "PictureURL": "/images/dragon_tattoo.jpg",
    "ReleaseYear": 2005,
    "Rating": 0,
    "PageNumber": 465,
    "Price": 16.50,
    "ISBN": "9780307454546",
    "QuantityInStock": 11,
    "PublisherId": 13,
    "GenreIds": [ 1, 2 ],
    "AuthorIds": [ 12 ]
  },
  {
    "Title": "Dark Matter",
    "Description": "Blending science fiction with psychological thriller, Blake Crouch’s 'Dark Matter' follows physicist Jason Dessen as he is abducted into an alternate reality where his life took a different path. The novel explores questions of identity, choices, and the nature of reality, combining suspenseful pacing with deep philosophical questions. Its inventive storytelling and emotional depth have earned it critical acclaim as a modern genre-defying bestseller.",
    "PictureURL": "/images/dark_matter.jpg",
    "ReleaseYear": 2016,
    "Rating": 0,
    "PageNumber": 342,
    "Price": 15.00,
    "ISBN": "9780345803494",
    "QuantityInStock": 10,
    "PublisherId": 14,
    "GenreIds": [ 11, 10 ],
    "AuthorIds": [ 13 ]
  },
  {
    "Title": "The Power of Habit",
    "Description": "Charles Duhigg’s nonfiction bestseller explores the science behind why habits exist and how they can be changed. Drawing from neuroscience, psychology, and real-world examples, the book explains how habits work, how they shape our lives, and how understanding them can lead to positive transformations. Packed with practical advice and engaging stories, 'The Power of Habit' offers readers tools to improve personal productivity, health, and relationships by mastering behavior change.",
    "PictureURL": "/images/power_of_habit.jpg",
    "ReleaseYear": 2012,
    "Rating": 0,
    "PageNumber": 371,
    "Price": 14.50,
    "ISBN": "9780812981605",
    "QuantityInStock": 14,
    "PublisherId": 15,
    "GenreIds": [ 17, 10 ],
    "AuthorIds": [ 14 ]
  },
  {
    "Title": "The Road",
    "Description": "Cormac McCarthy’s Pulitzer Prize-winning novel follows a father and his young son as they traverse a post-apocalyptic America devastated by an unspecified cataclysm. Facing starvation, harsh weather, and hostile survivors, their journey is a profound meditation on love, survival, and hope amidst despair. The sparse prose and haunting imagery create an unforgettable narrative about the bond between parent and child in the face of overwhelming adversity.",
    "PictureURL": "/images/the_road.jpg",
    "ReleaseYear": 2006,
    "Rating": 0,
    "PageNumber": 287,
    "Price": 15.50,
    "ISBN": "9780307387899",
    "QuantityInStock": 10,
    "PublisherId": 16,
    "GenreIds": [ 23, 24 ],
    "AuthorIds": [ 15 ]
  }
]
